app/controllers/coming_soon_controller.rb

SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY 'bj.neilsen@gmail.com') LIMIT 1
INSERT INTO `users` (`updated_at`, `first_name`, `subscribed`, `last_name`, `email`, `created_at`) VALUES('2008-12-03 08:42:22', NULL, 1, NULL, 'angelee.neilsen@gmail.com', '2008-12-03 08:42:22')
---
  def subscribe
    if request.post?
      unless params[:email].empty? || !/[-a-z0-9._]+@[-a-z0-9._]+\.[a-z]{2,10}/i.match(params[:email])
        unless User.find_by_email(params[:email])
          User.create!(:email => params[:email], :subscribed => true)

SELECT `users`.id FROM `users` WHERE (`users`.`email` = BINARY 'bj.neilsen@gmail.com' AND `users`.id <> 1) LIMIT 1
UPDATE `users` SET `updated_at` = '2008-12-03 08:36:12', `subscribed` = 0 WHERE `id` = 1
---
  def unsubscribe
    if request.post?
      user = User.find_by_email(params[:email])
      if user
        user.subscribed = false
        user.save!